run/pitzDaily_PANSkEps_gather/pitzDaily_fK_TEST/0/fK
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.1";
    object      fK;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.1;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.1;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0.1;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0.1;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
